Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БНС_ОстаткиИСМП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровУслуг/Forms/ФормаДокументаТовары/Ext/Form/Module.bsl
&НаСервере
Процедура БНС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ БНС_БереговойНС 27.09.2026
	НоваяКоманда = ЭтаФорма.Команды.Добавить("БНС_ЗаполнитьКодыМаркировкиПоОстаткам");
	НоваяКоманда.Заголовок = "(БНС) Заполнить коды маркировки по остаткам";
	НоваяКоманда.Действие = "БНС_ЗаполнитьКодыМаркировкиПоОстаткам";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("БНС_ЗаполнитьКодыМаркировкиПоОстаткам", Тип("КнопкаФормы"), Элементы.ГруппаТоварыЗаполнить);
	НовыйЭлемент.Заголовок = "(БНС) Заполнить коды маркировки по остаткам";
	НовыйЭлемент.ИмяКоманды = "БНС_ЗаполнитьКодыМаркировкиПоОстаткам";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("БНС_ОчиститьКодыМаркировки");
	НоваяКоманда.Заголовок = "(БНС) Очистить коды маркировки";
	НоваяКоманда.Действие = "БНС_ОчиститьКодыМаркировки";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("БНС_ОчиститьКодыМаркировки", Тип("КнопкаФормы"), Элементы.ГруппаТоварыЗаполнить);
	НовыйЭлемент.Заголовок = "(БНС) Очистить коды маркировки";
	НовыйЭлемент.ИмяКоманды = "БНС_ОчиститьКодыМаркировки";
	// -- БНС_БереговойНС 27.09.2026
	
	// ++ БНС: колонка "Количество" для частичного списания партионных кодов
	БНС_ДобавитьКоличествоВШтрихкодыУпаковок();
	// -- БНС
	
КонецПроцедуры

&НаСервере
Процедура БНС_ДобавитьКоличествоВШтрихкодыУпаковок()
	
	// ++ БНС: колонка добавляется программно, чтобы не менять штатную форму документа
	ТаблицаШтрихкоды = Элементы.Найти("ШтрихкодыУпаковок");
	Если ТаблицаШтрихкоды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти("ШтрихкодыУпаковокКоличество") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПолеКоличество = Элементы.Добавить("ШтрихкодыУпаковокКоличество", Тип("ПолеФормы"), ТаблицаШтрихкоды);
		ПолеКоличество.Вид         = ВидПоляФормы.ПолеВвода;
		ПолеКоличество.ПутьКДанным = "Объект.ШтрихкодыУпаковок.Количество";
		ПолеКоличество.Заголовок   = "Количество";
	Исключение
		// Не мешаем открытию формы: колонка не обязательна для заполнения и проведения
	КонецПопытки;
	// -- БНС
	
КонецПроцедуры

&НаКлиенте
Процедура БНС_ОчиститьКодыМаркировки(Команда)

	// ++ БНС_БереговойНС 27.09.2026
	ТекстВопроса = НСтр("ru = 'Табличная часть с кодами маркировки будет очищена. Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("БНС_ВопросПередОчисткойТабличнойЧастиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

&НаКлиенте
Процедура БНС_ВопросПередОчисткойТабличнойЧастиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		БНС_ОчиститьКодыМаркировкиНаСервере();
		
		ПоказатьОповещениеПользователя("Коды маркировки успешно очищены", ,"Успешно выполнена очистка кодов маркировки", БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Информация);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БНС_ЗаполнитьКодыМаркировкиПоОстаткам(Команда)

	// ++ БНС_БереговойНС 27.09.2026
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;	
	
	ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
	Оповещение = Новый ОписаниеОповещения("БНС_ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

&НаКлиенте
Процедура БНС_ВопросПередЗаполнениемТабличнойЧастиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ИтогЗаполнения = БНС_ЗаполнитьКодыМаркировкиПоОстаткамНаСервере();
		
		СтатусОповещения = ?(ИтогЗаполнения.Успех, СтатусОповещенияПользователя.Информация, СтатусОповещенияПользователя.Важное);
		ПоказатьОповещениеПользователя(ИтогЗаполнения.Заголовок, , ИтогЗаполнения.Текст, БиблиотекаКартинок.Информация, СтатусОповещения);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура БНС_ОчиститьКодыМаркировкиНаСервере()
	
	// ++ БНС_БереговойНС 27.09.2026
	Объект.ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

&НаСервере
Функция БНС_ЗаполнитьКодыМаркировкиПоОстаткамНаСервере()
	
	// ++ БНС_БереговойНС 27.09.2026
	// Гибридный подбор: одиночный код = 1 единица, групповой код с количеством
	// (ИИ 37) - с учетом объема кода и частичным списанием (50 из 100).
	РезультатПодбора = БНС_ОбщегоНазначенияГИСМ.ПодобратьКодыМаркировки(Объект.Ссылка);
	
	Объект.ШтрихкодыУпаковок.Очистить();
	
	КоличествоКодов  = 0;
	КоличествоЕдиниц = 0;
	
	Для Каждого СтрокаКода Из РезультатПодбора.Коды Цикл
		НоваяСтрока = Объект.ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = СтрокаКода.ШтрихкодУпаковки;
		НоваяСтрока.Количество       = СтрокаКода.Количество;
		КоличествоКодов  = КоличествоКодов + 1;
		КоличествоЕдиниц = КоличествоЕдиниц + СтрокаКода.Количество;
	КонецЦикла;
	
	// Контроль: сумма количеств в подобранных кодах должна совпадать с количеством товара
	Для Каждого СтрокаКонтроля Из РезультатПодбора.Контроль Цикл
		Если Не СтрокаКонтроля.Совпадает Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				"Сумма количеств в кодах не совпадает с количеством товара %1: по документу %2, по кодам %3.",
				СтрокаКонтроля.Номенклатура, СтрокаКонтроля.КоличествоДокумент, СтрокаКонтроля.КоличествоКоды));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекстСообщения Из РезультатПодбора.Сообщения Цикл
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	// Итоговое оповещение - фактический результат подбора
	Итог = Новый Структура("Успех, Заголовок, Текст");
	Если КоличествоКодов = 0 Тогда
		Итог.Успех     = Ложь;
		Итог.Заголовок = "Коды маркировки не подобраны";
		Итог.Текст     = "Свободные коды не найдены - см. окно сообщений";
	ИначеЕсли РезультатПодбора.Успех Тогда
		Итог.Успех     = Истина;
		Итог.Заголовок = "Коды маркировки заполнены";
		Итог.Текст     = СтрШаблон("Подобрано кодов: %1, единиц продукции: %2", КоличествоКодов, КоличествоЕдиниц);
	Иначе
		Итог.Успех     = Ложь;
		Итог.Заголовок = "Коды маркировки заполнены частично";
		Итог.Текст     = СтрШаблон("Подобрано кодов: %1, единиц: %2. Есть расхождения - см. окно сообщений", КоличествоКодов, КоличествоЕдиниц);
	КонецЕсли;
	Если РезультатПодбора.НеМаркируемыеПозиции > 0 Тогда
		Итог.Успех = Ложь;
		Итог.Текст = Итог.Текст + СтрШаблон(" Без кодов (нет в описании номенклатуры ИС): %1 поз.", РезультатПодбора.НеМаркируемыеПозиции);
	КонецЕсли;
	
	Возврат Итог;
	
КонецФункции // -- БНС_БереговойНС 27.09.2026
